[
  "Code: 7811432 \nSummary: Piedra Roja Block 22 Tempranillo is a Californian red wine from Irwin Family Vineyards. It has an alcohol content of 13.5% and is made from the Tempranillo grape. The wine is described as full-bodied with medium acidity. It has a rating of 4.1 out of 5. It pairs well with beef, pasta, vegetarian dishes, and cured meat. The recommended vintages are 2015 and 2014. The wine contains sulfites and is from the United States, specifically the Sierra Foothills region in California. No specific interesting facts are provided about the wine.",
  "Code: 4726100 \nSummary: The Cabernet Franc from Crocker & Starr is a Californian wine with an alcohol content of 14.4%. It has a rating of 4.4 and is described as medium-bodied with high acidity. The wine is made from Cabernet Franc grapes and is produced in the Napa Valley region of California. It pairs well with beef, pork, game (deer, venison), and poultry. The recommended vintages include 2018 for its price-to-quality ratio, 2015 for being highly rated by users, 2016 for being the most user-rated, 2012 for being top-ranked, and 2021 for being the latest available vintage. The wine contains sulfites and is represented by an image accessible through the provided URL. Further interesting facts or a detailed wine description are not available in the provided data.",
  "Code: 4742024 \nSummary: Réserve Auguste Favier Châteauneuf-du-Pape is a red wine from Domaine Saint Préfert with an alcohol content of 14.5%. It is made from Grenache grapes and has medium acidity and a very full-bodied style. The wine is rated 4.2 by the winery and is recommended for pairing with lamb, pork, and poultry. The wine is produced in the Châteauneuf-du-Pape region in the Southern Rhône of France and contains sulfites.",
  "Code: 137274802 \nSummary: Saint-Pierre Bordeaux Supérieur Tradition from Château Ferran is a Bordeaux red wine from the Bordeaux Supérieur region in France. It is a full-bodied wine with high acidity and has flavors that are more nuanced and less fruit-forward. This wine pairs well with game meats, roast lamb, and hearty beef stews. The grapes used in this wine are Cabernet Sauvignon, Cabernet Franc, and Merlot. Bordeaux reds are known for being terroir-driven, reflecting the specific characteristics of the region's soil and climate. Saint-Pierre Bordeaux Supérieur Tradition is an affordable table wine, and it is part of the largest wine producing region in France.",
  "Code: 1709547\nSummary: The Canada Family Vineyard Reserve Cabernet Sauvignon is a red wine from Becker Vineyards in Texas. It has an alcohol content of 13.6% and is made from the Cabernet Sauvignon grape. The wine has a medium acidity and is full-bodied. It is rated 3.8 by the winery and has flavors of ripe grapes. It pairs well with beef, lamb, game, mature and hard cheese, and mushrooms. The recommended vintages are 2009, 2017, and 2015.",
  "Code: 1471485 \nSummary: Chianti is a medium-bodied Italian Chianti wine from Tenuta Castiglioni. It has a high acidity rating and is made from Sangiovese grapes. With tart and fresh flavors of cherry, strawberries, and red plums, this wine is known for its earthy notes, herbs, and tobacco from aging, with a hint of balsamic. Chianti is versatile with food and pairs well with pizza, tomato-based dishes, and grilled meats infused with fresh herbs. The wine has an alcohol content of 12.5% and contains sulfites. It is wrapped in distinct straw-covered bottles called 'fiascos', hand-woven by local artisans. Notably, Chianti is associated with the iconic image of Lady and the Tramp enjoying a spaghetti dinner lit by a candle burning in an empty Chianti bottle. Hannibal Lector's famous quote referring to Chianti and fava beans also adds to its interesting facts. The wine is mainly produced in the Chianti region of Tuscany, which is renowned for its rolling green hills and picturesque Roman ruins. The Chianti label with 'Classico' indicates the original historic growing area with the best vineyards and features a distinctive black rooster on the bottle. Recommended vintages include 2022 as top-listed, 2020 as best_user_rated, 2019 as most_user_rated, and 2021 as top_ranked. Food pairings for Chianti include beef, veal, and poultry. The wine has a winery rating of 3.8.",
  "Code: 3149450 \nSummary: Reserve Tempranillo is a Texas Tempranillo Red wine from Becker Vineyards with an alcohol content of 13.6%. It has a medium acidity rating of 2 and a full-bodied body rating of 4. The wine is made from Tempranillo grapes and is recommended to be paired with beef, pasta, game (deer, venison), and mature and hard cheese. The wine has a winery rating of 3.8. The image of the wine can be found at https://images.vivino.com/thumbs/Kh9ChgaLRra1FfX4620jQw_pl_480x640.png. The recommended vintages are 2014 (best_user_rated), 2013 (most_user_rated), and 2017 (top_ranked).",
  "Code: 1493785 \nSummary: Iconoclast Cabernet Sauvignon is a full-bodied Texas Cabernet Sauvignon red wine from Becker Vineyards. It has an alcohol content of 13.7% and is made from Cabernet Sauvignon grapes. The wine has a medium acidity rating of 2 and a body rating of 4. It has base stats of 3 for acidity, 0 for fizziness, 4 for intensity, 1 for sweetness, and 4 for tannin. The wine is recommended for pairing with beef, lamb, game, mature and hard cheese, and mushrooms. It has a winery rating of 3.8. The wine is allergen-free except for sulfites. It is available in vintages from 2009, 2017, and 2020, with 2017 being the most highly rated by users. Unfortunately, there is no additional interesting facts or description provided for this wine. The wine can be visualized through the included image.",
  "Code: 144640983 \nSummary: Wilmeth Vineyard Reserve Cabernet Sauvignon is a full-bodied Texas red wine from Becker Vineyards. It has an alcohol content of 13.3% and is made from Cabernet Sauvignon grapes. The wine has a medium acidity (rated 2 out of 5) and a high intensity (rated 4 out of 5). It is moderately sweet (rated 1 out of 5) and has a significant tannin presence (rated 4 out of 5). The winery has a rating of 3.8. Recommended vintages include 2014 for being highly user-rated, 2017 for being the most user-rated, and 2015 for being top-ranked. The wine pairs well with beef, lamb, game (deer, venison), mature and hard cheese, and mushrooms.",
  "Code: 172419031 \nSummary: The Iconoclast Main Street Reserve Cabernet Sauvignon from Becker Vineyards is a full-bodied Texas Cabernet Sauvignon red wine with a 15.3% alcohol content. It has a medium acidity rating and a high intensity level. The wine has a sweetness level of 1 and a tannin rating of 4. It is made from Cabernet Sauvignon grapes and is produced in the United States, specifically in the Texas High Plains region. The wine has received a rating of 3.8. It pairs well with beef, lamb, game, mature and hard cheese, and mushrooms. The wine is best from the 2017 vintage according to user ratings. It contains sulfites and the interesting facts about the wine are not specified.",
  "Code: 3178848 \nSummary: Cuvée Sarah Bordeaux Supérieur is a Bordeaux red wine from Château Petit-Freylon. It has an alcohol content of 13.5% and contains sulfites. The wine is made from a blend of Cabernet Sauvignon and Merlot grapes. Bordeaux reds are known for their nuanced flavors and elegance, pairing well with game meats, roast lamb, and beef stews. The wine is terroir-driven, showcasing the characteristics of the Bordeaux region. Château Petit-Freylon is rated 3.6 out of 5. The recommended vintages are 2020, 2012, and 2018.",
  "Code: 4739503 \nSummary: Culinaria is a Texas Red wine produced by Becker Vineyards. It has an alcohol content of 13.7% and contains sulfites. The wine is made from a blend of Shiraz/Syrah, Cabernet Sauvignon, Cabernet Franc, Malbec, Merlot, and Mourvedre grapes. It has a medium level of acidity and is described as full-bodied. The wine pairs well with beef, lamb, and game (deer, venison). The recommended vintages are 2017 (best user rated), 2012 (most user rated), and 2018 (top ranked).",
  "Code: 1518744\nSummary: The Côtes-du-Rhône-Villages 'Plan de Dieu' is a red wine from Château Saint-Jean in the Southern Rhône region of France. It is a blend of Shiraz/Syrah, Grenache, and Mourvedre grapes. The wine has a high acidity and is full-bodied. It has flavors of jammy red and black fruits, as well as earth, leather, spice, and dried herbs. The region is known for its warm climate and Mediterranean influences, which result in rich and easy-drinking wines. This particular wine has moderate tannins and alcohol content. Pairings include beef, lamb, and game.",
  "Code: 4892233\nSummary: The Le Quattro Stagioni Barbera-Merlot is a Texas Red wine produced by Becker Vineyards. It has a medium acidity and a full-bodied profile. The wine has an alcohol content of 15.5% and is made from a blend of Merlot and Barbera grapes. It has a sweetness rating of 1.5 and a tannin rating of 4. The recommended vintages for this wine are from 2012, which have been highly rated by users. This wine pairs well with beef, lamb, and game (deer, venison). The winery has a rating of 3.8. Please note that no specific description or interesting facts are provided for this wine.",
  "Code: 152620383\nSummary: Réserve Spéciale Saint-Émilion is a Bordeaux Saint-Émilion wine from Barons de Rothschild (Lafite). It is predominantly made from Merlot and Cabernet Franc grapes. This wine has a rich and mouth-drying tannic structure, balanced by juicy plum and black cherry fruit flavors, along with notes of chocolate and sweet spice. As it ages, it develops savory tobacco and cedar characteristics. The vines planted on limestone escarpment soil give this wine a terrific mineral vein. The region of Saint-Émilion, situated on the right bank of Bordeaux, produces a diverse range of styles due to differences in soil types, from gravel to limestone to sand. Réserve Spéciale Saint-Émilion pairs well with beef, lamb, game (deer, venison), and poultry. It is rated 3.7 out of 5 by the winery.",
  "Code: 2698708 \nSummary: Reserve Merlot is a Texas Red wine from Becker Vineyards. It has a medium acidity and a full-bodied style. The wine is made from Merlot grapes and has a sweetness rating of 1.5. It has a tannin rating of 4 and an intensity rating of 4. The wine is recommended for pairing with beef, lamb, and game. It has a winery rating of 3.8. The wine is allergen-free except for sulfites. It is produced in the United States, specifically in the Texas Hill Country region. The wine has no interesting facts recorded. It has recommended vintages of 2015 (best user rated), 2017 (most user rated), and 2014 (top ranked).",
  "Code: 170239331\nSummary: Tallent Vineyard Barbera is a Texas Red wine from Becker Vineyards with a 14.2% alcohol content. It has medium acidity and a full-bodied profile. The wine is made from Barbera grapes and has a tannin level of 4. Recommended food pairings include beef, lamb, and game. The wine has a rating of 3.8 and is best consumed in the 2019 vintage. It contains sulfites and is produced in the United States, specifically in the Texas Hill Country region. Unfortunately, no interesting facts or detailed description of the wine are available.",
  "Code: 150744368\nSummary: Nello is a Bordeaux Blend wine from Sciandri with an alcohol content of 14.1%. It has medium acidity, a full-bodied body rating, and a sweetness rating of 1. The wine has a tannin rating of 4 and an intensity rating of 5. It is made from a blend of Cabernet Sauvignon, Cabernet Franc, Malbec, Merlot, and Petit Verdot grapes. The wine is produced in the Coombsville region of Napa Valley, California. It is recommended to pair Nello with beef, lamb, game (deer, venison), or poultry. The winery has a rating of 4.3.",
  "Code: 156986924 \nSummary: Le Quattro Stagione Primavera Reddy Vineyard Merlot is a Texas Red wine from Becker Vineyards. It has a medium acidity and a full-bodied style. The wine has an alcohol content of 14.5% and contains sulfites. It is made from Merlot grapes from the United States/Texas/Texas High Plains region. The wine has a sweetness rating of 1.5 and a tannin rating of 4. It is best paired with beef, lamb, and game (deer, venison). The wine has a winery rating of 3.8. Unfortunately, there is no additional information available about its tasting notes or interesting facts. The recommended vintages are 2015, which are best user-rated. \n\n![Wine Image](https://images.vivino.com/labels/mvd8bHl9Qpecl0_9MheIYA.jpg)",
  "Code: 134644422 \nSummary: The wine with the code 134644422 is Pontaclynch Margaux Cru Bourgeois. Unfortunately, the WineData provided does not contain any specific information about the wine's characteristics, such as alcohol content, grape variety, region, winery, or interesting facts. Additionally, there is no information about the wine's style, acidity, body, or recommended vintages. The wine appears to have no food pairings listed either. The only available information is that the wine contains sulfites and there is an image of the wine label provided.",
  "Code: 1668838 \nSummary: Saint-Émilion Grand Cru is a Bordeaux wine from Château La Confession. It is made predominantly from Merlot and Cabernet Franc grapes. This wine has a rich, mouth-drying tannic structure balanced by juicy plum and black cherry fruit flavors, along with chocolate and sweet spice notes. With age, it develops savory tobacco and cedar characteristics. The region of Saint-Émilion is known for its diverse range of wine styles due to differences in soil types and winemaking techniques. Saint-Émilion is a UNESCO World Heritage Site and the first Bordeaux region to export its wines. It has a rating of 4 out of 5 and pairs well with beef, lamb, game, and poultry. The recommended vintages include 2015, 2014, 2013, and 2017.",
  "Code: 4730154\nSummary: Zinfandel is a Californian wine from the Mauritson winery. It is a fruit-forward wine with bursts of jam, cherry, blueberry, and plums, accompanied by licorice, spices, and pepper. Zinfandel has been grown in California since the mid-1800s and is known for its bold flavor profile and relatively high alcohol content of 14-17% ABV. It pairs well with robust flavors like spice-rub BBQ, mature cheese, beef, lamb, and poultry.",
  "Code: 2240520 \nSummary: Brunello di Montalcino from Renieri is a highly-acclaimed Italian red wine made entirely from Sangiovese grapes. It is known for its boldness and ability to reflect the terroir of the Montalcino region. With high acidity and a very full-bodied profile, it pairs well with protein-rich dishes and salted cheeses. Brunello must be aged for 4 years before release, with at least 2 years spent in barrel. It has a 14% alcohol content and contains sulfites. Brunello di Montalcino is a collectible wine that ages well and has received the top classification of Denominazione di Origine Controllata e Garantita (DOCG).",
  "Code: 2692981 \nSummary: Saint-Émilion Grand Cru from Château de Lescours is a Bordeaux wine that is made predominantly from Merlot and Cabernet Franc grapes. It has a rich, mouth-drying tannic structure balanced by juicy characteristics of plum and black cherry fruit, along with chocolate and sweet spice flavors. With age, it develops savory tobacco and cedar characteristics. The wine is known for its mineral vein due to the region's limestone escarpment and its diverse range of styles resulting from differences in soil types. It pairs well with beef, lamb, game, and poultry. The wine has an alcohol content of 13.5% and may contain sulfites. It is classified as Bordeaux Saint-Émilion and has a body rating of full-bodied. The recommended vintages include 2016 (best user rated), 2015 (most user rated), and 2018 (top ranked).",
  "Code: 144642471 \nSummary: The Vintage Port is a wine from Becker Vineyards in the United States, specifically Texas. It has a rating of 3.8. Unfortunately, there is no detailed description or information about the style, grapes, alcohol content, acidity, body, or sweetness of the wine. It is recommended for vintages from 2012, which are considered the best-rated by users. The wine contains sulfites and an image can be found at the provided URL. The food pairings and interesting facts about the Vintage Port are not available.",
  "Code: 3790437 \nSummary: The Cabernet Sauvignon - Cabernet Franc wine from Wolf Family Vineyards is a Napa Valley Bordeaux Blend with a rating of 4.3. It has medium acidity and a full-bodied profile. The wine pairs well with beef, lamb, game, and poultry. It contains sulfites and is made from Cabernet Sauvignon and Cabernet Franc grapes. The wine has a tannin rating of 4 and an intensity rating of 5. The alcohol content and interesting facts about the wine are not provided. The recommended vintages and a detailed wine description are also not available. The wine label can be viewed through the provided image link.",
  "Code: 1737056 \nSummary: Cos d'Estournel is a Bordeaux Saint-Estèphe wine from Cos d'Estournel winery. It has a high acidity rating and is described as full-bodied. The wine is made from Cabernet Sauvignon grapes and has a 13.5% alcohol content. It is known for its powerful and concentrated characteristics, with notes of cassis, tobacco, cigar box, and crushed stone. The wine has austere, gritty tannins in its youth but can age extremely well. Saint-Estèphe, where the wine is produced, is the northernmost appellation in the Médoc region of Bordeaux. The winery is rated 4.3 and the recommended vintages include 2016, 2009, 2003, 2020, 2006, 1989, 1986, and 2017. The wine pairs well with beef, lamb, game, and poultry.",
  "Code: 1518143 \nSummary: Haut-Médoc is a Bordeaux Haut-Médoc Red wine from Château Larose-Trintaudon. It has a high acidity rating and a full-bodied body rating. The wine has a sweetness rating of 1 and a tannin rating of 5. With an alcohol content of 14%, it contains sulfites, egg allergens, and milk allergens. The grapes used in this wine are Merlot and Cabernet Sauvignon. It is recommended to pair this wine with beef, lamb, or game (deer, venison). The wine has a rating of 3.9 and the recommended vintages are 2019, 2018, 2016, 2015, and 1995.",
  "Code: 162513072 \nSummary: Reddy Vineyard Carignan is a Texas Red wine from Becker Vineyards. It has a medium acidity and a full-bodied style. The wine has an alcohol content of 12.9% and contains sulfites. The grapes used in this wine are Carignan. It pairs well with beef, lamb, and game meats. The wine is rated 3.8 by the winery. The recommended vintages for this wine are from 2017, with the best user ratings. Unfortunately, there are no interesting facts or detailed description available for this wine. The image of the wine label can be accessed through the provided URL.",
  "Code: 3038919 \nSummary: Atlántico Sur Reserve Tannat is a wine from Familia Deicas, produced in Canelones, Uruguay. This Tannat wine is known for its powerful flavors of plums and blackberries, with complex notes of herbs, chocolate, leather, earth, and minerals. The tannins have been softened through winemaking techniques, resulting in a more approachable and enjoyable wine. With a high acidity and full-bodied profile, this wine pairs well with hearty steaks and grilled meats. It has an alcohol content of 12.5% and contains sulfites. The recommended vintages for this wine are 2018, 2015, and 2016, with 2018 being the best user-rated vintage.",
  "Code: 4698169 \nSummary: Petite Sirah is a Californian wine from Homewood. It is known for its high tannin and acidity levels, with strong blackberry notes and a hint of cracked black pepper. Developed as a hybrid grape in the 1870s, it is often blended with Zinfandel and has been used to contribute body and depth to other wines. Petite Sirah pairs well with beef, lamb, game, and barbecued meat.",
  "Code: 4194987\nSummary: Claret is a Texas Red wine produced by Becker Vineyards. It has an alcohol content of 13.6% and contains sulfites. The wine is made from a blend of Malbec, Merlot, Petit Verdot, Cabernet Sauvignon, and Cabernet Franc grapes. It has medium acidity and a full-bodied character. The wine is known for its intensity and moderate tannin level. It pairs well with beef, lamb, and game like deer or venison. The wine has a rating of 3.8 and recommended vintages include 2016, 2013, and 2011. Unfortunately, there is no additional interesting information available about this wine.",
  "Code: 164346502\nSummary: Vice Malbec is a full-bodied red wine from Red 55 Winery. It is made from Malbec grapes and has a medium acidity. The wine has a sweetness rating of 1.5 and a tannin rating of 4. With an intensity rating of 4, this wine is known for its bold flavors. It is produced in the United States, specifically in Texas. The wine has a rating of 3.7 and pairs well with beef, lamb, and game. Recommended vintages for Vice Malbec are from 2018.",
  "Code: 4739506 \nSummary: The Reserve Cabernet Franc is a red wine from Becker Vineyards in the United States, specifically from Texas. It has a medium acidity and is full-bodied, making it suitable for pairing with beef, lamb, and game. The wine has a rating of 3.8 and is made from Cabernet Franc grapes. Recommended vintages for this wine are 2017, 2015, and 2019.",
  "Code: 1484203\nSummary: The Cabernet Sauvignon Silver Label from B.R. Cohn is a Californian wine with a 14.3% alcohol content. It is a dry and full-bodied Cabernet Sauvignon, known for its green flavors like bell pepper, dark fruits like blackberry, and hints of eucalyptus and mint. This wine has moderate to high tannin levels and concentrated flavors, making it an excellent choice for pairing with beef, lamb, game, and poultry dishes. It is produced in the United States, specifically the North Coast region of California. The wine is highly rated, with a rating of 4 for the B.R. Cohn winery.",
  "Code: 4744785 \nSummary: Pomerol is a Bordeaux Pomerol wine from Château La Croix St. Georges. It has an alcohol content of 13.5% and contains sulfites. The wine is made from Merlot grapes and has a rich, decadent flavor profile with notes of chocolate, dark cherry, plums, and spice. It has soft tannins and elegance. Pomerol is the smallest of Bordeaux's major appellations and the only major Bordeaux appellation that has not been classified. The region claims the three most expensive wines produced in Bordeaux: Château Pétrus, Château Le Pin, and Château Lafleur. The wines of Château Pétrus are planted on unique blue clay soils, which are considered the best terroir in Pomerol and are approximately 40 million years old. Pomerol wines come from small estates that command premium prices. Approximately 80 percent of the region's plantings are Merlot. The wine pairs well with beef, lamb, game, and poultry.",
  "Code: 3651693\nSummary: Margaux is a Bordeaux Margaux wine from Château La Tour de Bessan in France. It has a deep ruby color with perfumed and floral notes, including violets and lilacs. The wine has soft, silky tannins and is known for its refinement and elegance. Margaux is the furthest south appellation in the Médoc region and has various soil types, which can result in varying styles and quality. The best Margaux wines come from grapes planted on gravel soils with good drainage. The wine has an alcohol content of 12.5% and contains sulfites. It is made from a blend of Petit Verdot, Cabernet Sauvignon, and Merlot grapes. Margaux has the most châteaux included in the 1855 Classification of the Médoc and Graves. It is believed to be home to the first planting of vines by the Romans and typically experiences an early harvest. Château Margaux and Château Palmer are consistently considered the best wines from Margaux. The wine pairs well with beef, lamb, game (deer, venison), and poultry.",
  "Code: 145322935\nSummary: Nicasia Vineyards Red Blend Malbec is a full-bodied Argentinian Uco Valley Malbec red wine from Catena Zapata. It has a acidity rating of 2 (medium) and a body rating of 4 (full-bodied). The wine has a sweetness rating of 1.5, tannin rating of 3, and an intensity rating of 4. The recommended vintages for this wine are 2019 (best user-rated), 2018 (most user-rated), and 2020 (top-ranked). It pairs well with beef and lamb. The wine has a winery rating of 4.3. The grapes used in this wine are Malbec. The wine contains sulfites and is from the region of Argentina / Mendoza / Uco Valley / Vista Flores. Unfortunately, there is no additional information available regarding the facts, wine description, or interesting facts about this wine. Here is an image of the wine: [Image](https://images.vivino.com/thumbs/nQ-uwsRHQWO7OvkQ2PS5Zw_pl_480x640.png)",
  "Code: 167089684 \nSummary: GSM is a Texas Red wine from Becker Vineyards with an alcohol content of 14.2%. It is a full-bodied wine with medium acidity and a sweetness level of 1.5. The wine is made from Mourvedre, Shiraz/Syrah, and Grenache grapes. It has a tannin rating of 4 and is recommended for pairing with beef, lamb, and game. The wine has a winery rating of 3.8 and is produced in the United States, specifically in the Texas Hill Country region.",
  "Code: 1653753 \nSummary: Grand Barossa Cabernet Sauvignon from Château Tanunda is a full-bodied Australian Cabernet Sauvignon wine with an alcohol content of 14.5%. It has a classic Cabernet taste of dark, rich fruit, cedar, and mint, accompanied by flavors of eucalyptus. The wine possesses a beautiful balance of fruit, acidity, and tannin, making it delightful after a few years of aging. It pairs well with beef, lamb, and poultry dishes. Some interesting facts about the wine include that it contains sulfites, and it is made from Cabernet Sauvignon grapes. Château Tanunda is the winery behind this wine, with a rating of 3.8. The recommended vintages are 2021 (best user-rated), 2019 (most user-rated), and 2015 (top-ranked).",
  "Code: 161050356 Summary: Ranger Hays is a red wine from Becker Vineyards in the United States, specifically from Texas. It is a full-bodied Texas Red wine made from a blend of Petit Verdot, Malbec, and Merlot grapes. The wine has a moderate level of acidity and a high intensity. It is slightly sweet with a tannin rating of 4. The alcohol content of the wine is 14.2%. The wine is recommended to be paired with beef, lamb, and game (deer, venison) dishes. It has a winery rating of 3.8. The wine is available in vintages from 2017 to 2018, with the 2018 vintage being top-listed and the 2017 vintage being best user-rated. The wine label image can be viewed using the provided URL.",
  "Code: 151764603 Summary: Estate Reserve Petite Sirah is a Texas Red wine from Becker Vineyards. It is a full-bodied wine with medium acidity and a sweetness rating of 1.5. The wine has intense flavors and a high tannin content. It is made from Petite Sirah grapes and has a winery rating of 3.8. The wine pairs well with beef, lamb, and game meats. Recommended vintages include 2015 and 2018. The wine contains sulfites and is from the United States, specifically the Texas Hill Country region. Unfortunately, there is no additional description or interesting facts available for this wine.",
  "Code: 162261585\nSummary: Farmhouse Vineyards Counoise is a full-bodied red wine from Becker Vineyards in Texas. It has an alcohol content of 13.9% and a rating of 3.8. The wine is made from Counoise grapes, and its characteristics include medium acidity, high intensity, and medium sweetness. It has a tannin rating of 4 and is described as a Texas Red style wine. The recommended vintages are 2018, which is best user-rated. The wine pairs well with beef, lamb, and game such as deer or venison. It contains sulfites and comes from the United States, specifically the Texas High Plains region. Unfortunately, there are no interesting facts or detailed wine description available for this wine.",
  "Code: 148139670 \nSummary: Inverno Red is a Texas Red wine from Becker Vineyards. It has an alcohol content of 13.2% and contains sulfites. The wine is made from a blend of Cabernet Sauvignon, Merlot, and Petit Verdot grapes. It has medium acidity and a full-bodied profile. This wine has a tannin level of 4 and a sweetness level of 1.5. It is best paired with beef, lamb, and game (deer, venison). Inverno Red is rated 3.8 by the winery.",
  "Code: 3651959 \nSummary: The Reserve Malbec from Becker Vineyards is a Texas Red wine with a medium acidity and full-bodied profile. It has a rating of 3.8 and is made from the Malbec grape variety. The wine has a sweetness level of 1.5 and a tannin level of 4. It pairs well with beef, lamb, and game meats like deer and venison. The wine is known for its intensity and contains sulfites as allergens. The recommended vintages include 2019, 2017, and 2016. Unfortunately, no specific description of the wine is provided.",
  "Code: 1470532\nSummary: Earthquake Cabernet Sauvignon from Michael David Winery is a Californian Cabernet Sauvignon with a 15% alcohol content. It is a dry, full-bodied wine with moderate to high tannin levels and concentrated flavors. The wine showcases green flavors like bell pepper, dark fruits like blackberry, with hints of eucalyptus, mint, earth, dusty notes, mocha, and cedar. It is highly rated by the winery and is recommended to be paired with beef, lamb, game (deer, venison), and poultry. The wine is part of the top-listed vintages in 2019 and the best user-rated vintage in 2021.",
  "Code: 152068634 \nSummary: The Wilmeth Vineyard Reserve Dolcetto is a Texas Red wine from Becker Vineyards. It has a medium acidity and a full-bodied profile. The wine is made from the Dolcetto grape variety and has a sweetness rating of 1.5 and a tannin rating of 4. It is recommended to pair this wine with beef, lamb, or game. The Becker Vineyards has a rating of 3.8 and the wine is produced in the United States, specifically in the Texas High Plains region. The wine image can be viewed at the provided link and it contains sulfites. The wine does not have any specific interesting facts listed and the alcohol content and wine description are not available. Recommended vintages are 2018 (best user-rated) and 2017 (most user-rated).",
  "Code: Test\nSummary: The Wilmeth Vineyard Reserve Dolcetto from Becker Vineyards is a full-bodied red wine made from the Dolcetto grape variety. It has a medium acidity and a sweetness level of 1.5. The wine has a high tannin content and an intensity rating of 4. There is no specific information about the alcohol content or interesting facts about the wine. It is produced in the United States, specifically in the Texas High Plains region. The winery, Becker Vineyards, has a rating of 3. It is recommended to pair this wine with lamb or game (deer, venison)."
]
